## Plan Result (sandbox-uksouth-sandbox)




<pre><code>Plan: 52 to add, 0 to change, 0 to destroy.</code></pre>

* Create
  * module.public-dns.azurerm_dns_a_record.this[&#34;cft-api-mgmt-appgw&#34;]
  * module.public-dns.azurerm_dns_a_record.this[&#34;ctscmail&#34;]
  * module.public-dns.azurerm_dns_a_record.this[&#34;cvp-recording&#34;]
  * module.public-dns.azurerm_dns_a_record.this[&#34;cvp-recording-01&#34;]
  * module.public-dns.azurerm_dns_a_record.this[&#34;cvp-recording-02&#34;]
  * module.public-dns.azurerm_dns_a_record.this[&#34;portal&#34;]
  * module.public-dns.azurerm_dns_cname_record.this[&#34;_1fc88e03b87b33fb04a3b1c5978e80b8&#34;]
  * module.public-dns.azurerm_dns_cname_record.this[&#34;_9af30f185640a6f0617d0d1ef8e9de95&#34;]
  * module.public-dns.azurerm_dns_cname_record.this[&#34;afdverify.cft-api-mgmt&#34;]
  * module.public-dns.azurerm_dns_cname_record.this[&#34;afdverify.hmi-apim&#34;]
  * module.public-dns.azurerm_dns_cname_record.this[&#34;afdverify.idam-user-dashboard&#34;]
  * module.public-dns.azurerm_dns_cname_record.this[&#34;afdverify.idam-web-admin&#34;]
  * module.public-dns.azurerm_dns_cname_record.this[&#34;afdverify.idam-web-public&#34;]
  * module.public-dns.azurerm_dns_cname_record.this[&#34;afdverify.idam-web-public-sprod&#34;]
  * module.public-dns.azurerm_dns_cname_record.this[&#34;afdverify.labs-louisehuyton-walkthrough&#34;]
  * module.public-dns.azurerm_dns_cname_record.this[&#34;afdverify.labs-zcwalkthrough-nodejs&#34;]
  * module.public-dns.azurerm_dns_cname_record.this[&#34;afdverify.plum&#34;]
  * module.public-dns.azurerm_dns_cname_record.this[&#34;afdverify.reformscan&#34;]
  * module.public-dns.azurerm_dns_cname_record.this[&#34;afdverify.sds-api-mgmt&#34;]
  * module.public-dns.azurerm_dns_cname_record.this[&#34;afdverify.toffee&#34;]
  * module.public-dns.azurerm_dns_cname_record.this[&#34;afdverify.www.plum&#34;]
  * module.public-dns.azurerm_dns_cname_record.this[&#34;cdnverify.cft-api-mgmt&#34;]
  * module.public-dns.azurerm_dns_cname_record.this[&#34;cdnverify.hmi-apim&#34;]
  * module.public-dns.azurerm_dns_cname_record.this[&#34;cdnverify.idam-user-dashboard&#34;]
  * module.public-dns.azurerm_dns_cname_record.this[&#34;cdnverify.idam-web-admin&#34;]
  * module.public-dns.azurerm_dns_cname_record.this[&#34;cdnverify.idam-web-public&#34;]
  * module.public-dns.azurerm_dns_cname_record.this[&#34;cdnverify.idam-web-public-sprod&#34;]
  * module.public-dns.azurerm_dns_cname_record.this[&#34;cdnverify.labs-louisehuyton-walkthrough&#34;]
  * module.public-dns.azurerm_dns_cname_record.this[&#34;cdnverify.labs-zcwalkthrough-nodejs&#34;]
  * module.public-dns.azurerm_dns_cname_record.this[&#34;cdnverify.plum&#34;]
  * module.public-dns.azurerm_dns_cname_record.this[&#34;cdnverify.reformscan&#34;]
  * module.public-dns.azurerm_dns_cname_record.this[&#34;cdnverify.toffee&#34;]
  * module.public-dns.azurerm_dns_cname_record.this[&#34;cft-api-mgmt&#34;]
  * module.public-dns.azurerm_dns_cname_record.this[&#34;hmi-apim&#34;]
  * module.public-dns.azurerm_dns_cname_record.this[&#34;idam-user-dashboard&#34;]
  * module.public-dns.azurerm_dns_cname_record.this[&#34;idam-web-admin&#34;]
  * module.public-dns.azurerm_dns_cname_record.this[&#34;idam-web-public&#34;]
  * module.public-dns.azurerm_dns_cname_record.this[&#34;idam-web-public-sprod&#34;]
  * module.public-dns.azurerm_dns_cname_record.this[&#34;labs-louisehuyton-walkthrough&#34;]
  * module.public-dns.azurerm_dns_cname_record.this[&#34;labs-zcwalkthrough-nodejs&#34;]
  * module.public-dns.azurerm_dns_cname_record.this[&#34;plum&#34;]
  * module.public-dns.azurerm_dns_cname_record.this[&#34;plum.uksouth&#34;]
  * module.public-dns.azurerm_dns_cname_record.this[&#34;reformscan&#34;]
  * module.public-dns.azurerm_dns_cname_record.this[&#34;sds-api-mgmt&#34;]
  * module.public-dns.azurerm_dns_cname_record.this[&#34;toffee&#34;]
  * module.public-dns.azurerm_dns_cname_record.this[&#34;www.plum&#34;]
  * module.public-dns.azurerm_dns_mx_record.this[&#34;@&#34;]
  * module.public-dns.azurerm_dns_mx_record.this[&#34;contact.justice&#34;]
  * module.public-dns.azurerm_dns_txt_record.this[&#34;_dmarc.contact.justice&#34;]
  * module.public-dns.azurerm_dns_txt_record.this[&#34;contact.justice&#34;]
  * module.public-dns.azurerm_dns_zone.zone
  * module.public-dns.azurerm_role_assignment.dnszonecontributer




<details><summary>Change Result (Click me)</summary>

```hcl

  # module.public-dns.azurerm_dns_a_record.this["cft-api-mgmt-appgw"] will be created
  + resource "azurerm_dns_a_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "cft-api-mgmt-appgw"
      + records             = [
          + "20.108.143.135",
        ]
      + resource_group_name = "reformmgmtrg"
      + ttl                 = 60
      + zone_name           = "sandbox.platform.hmcts.net"
    }

  # module.public-dns.azurerm_dns_a_record.this["ctscmail"] will be created
  + resource "azurerm_dns_a_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "ctscmail"
      + records             = [
          + "51.140.180.140",
        ]
      + resource_group_name = "reformmgmtrg"
      + ttl                 = 3600
      + zone_name           = "sandbox.platform.hmcts.net"
    }

  # module.public-dns.azurerm_dns_a_record.this["cvp-recording"] will be created
  + resource "azurerm_dns_a_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "cvp-recording"
      + records             = [
          + "51.132.42.92",
        ]
      + resource_group_name = "reformmgmtrg"
      + ttl                 = 60
      + zone_name           = "sandbox.platform.hmcts.net"
    }

  # module.public-dns.azurerm_dns_a_record.this["cvp-recording-01"] will be created
  + resource "azurerm_dns_a_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "cvp-recording-01"
      + records             = [
          + "51.132.41.247",
        ]
      + resource_group_name = "reformmgmtrg"
      + ttl                 = 60
      + zone_name           = "sandbox.platform.hmcts.net"
    }

  # module.public-dns.azurerm_dns_a_record.this["cvp-recording-02"] will be created
  + resource "azurerm_dns_a_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "cvp-recording-02"
      + records             = [
          + "51.132.42.179",
        ]
      + resource_group_name = "reformmgmtrg"
      + ttl                 = 60
      + zone_name           = "sandbox.platform.hmcts.net"
    }

  # module.public-dns.azurerm_dns_a_record.this["portal"] will be created
  + resource "azurerm_dns_a_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "portal"
      + records             = [
          + "51.132.209.233",
        ]
      + resource_group_name = "reformmgmtrg"
      + ttl                 = 60
      + zone_name           = "sandbox.platform.hmcts.net"
    }

  # module.public-dns.azurerm_dns_cname_record.this["_1fc88e03b87b33fb04a3b1c5978e80b8"] will be created
  + resource "azurerm_dns_cname_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "_1fc88e03b87b33fb04a3b1c5978e80b8"
      + record              = "3FED4C626334D6135F1258241ADBBF36.F6728027F74DAF3E336958B894F24534.ma5er55rQa0HPM55O5Fq.comodoca.com"
      + resource_group_name = "reformmgmtrg"
      + ttl                 = 900
      + zone_name           = "sandbox.platform.hmcts.net"
    }

  # module.public-dns.azurerm_dns_cname_record.this["_9af30f185640a6f0617d0d1ef8e9de95"] will be created
  + resource "azurerm_dns_cname_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "_9af30f185640a6f0617d0d1ef8e9de95"
      + record              = "2135FD8EB464CCFADFCD6999525A52F0.230B7360D54C272A4FB658B45A962B2E.eb30a0ede6e02b3430fe.comodoca.com."
      + resource_group_name = "reformmgmtrg"
      + ttl                 = 300
      + zone_name           = "sandbox.platform.hmcts.net"
    }

  # module.public-dns.azurerm_dns_cname_record.this["afdverify.cft-api-mgmt"] will be created
  + resource "azurerm_dns_cname_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "afdverify.cft-api-mgmt"
      + record              = "afdverify.hmcts-sbox.azurefd.net"
      + resource_group_name = "reformmgmtrg"
      + ttl                 = 300
      + zone_name           = "sandbox.platform.hmcts.net"
    }

  # module.public-dns.azurerm_dns_cname_record.this["afdverify.hmi-apim"] will be created
  + resource "azurerm_dns_cname_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "afdverify.hmi-apim"
      + record              = "afdverify.hmcts-sbox.azurefd.net"
      + resource_group_name = "reformmgmtrg"
      + ttl                 = 300
      + zone_name           = "sandbox.platform.hmcts.net"
    }

  # module.public-dns.azurerm_dns_cname_record.this["afdverify.idam-user-dashboard"] will be created
  + resource "azurerm_dns_cname_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "afdverify.idam-user-dashboard"
      + record              = "afdverify.hmcts-sbox.azurefd.net"
      + resource_group_name = "reformmgmtrg"
      + ttl                 = 300
      + zone_name           = "sandbox.platform.hmcts.net"
    }

  # module.public-dns.azurerm_dns_cname_record.this["afdverify.idam-web-admin"] will be created
  + resource "azurerm_dns_cname_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "afdverify.idam-web-admin"
      + record              = "afdverify.hmcts-sbox.azurefd.net"
      + resource_group_name = "reformmgmtrg"
      + ttl                 = 300
      + zone_name           = "sandbox.platform.hmcts.net"
    }

  # module.public-dns.azurerm_dns_cname_record.this["afdverify.idam-web-public"] will be created
  + resource "azurerm_dns_cname_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "afdverify.idam-web-public"
      + record              = "afdverify.hmcts-sbox.azurefd.net"
      + resource_group_name = "reformmgmtrg"
      + ttl                 = 300
      + zone_name           = "sandbox.platform.hmcts.net"
    }

  # module.public-dns.azurerm_dns_cname_record.this["afdverify.idam-web-public-sprod"] will be created
  + resource "azurerm_dns_cname_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "afdverify.idam-web-public-sprod"
      + record              = "afdverify.hmcts-sbox.azurefd.net"
      + resource_group_name = "reformmgmtrg"
      + ttl                 = 300
      + zone_name           = "sandbox.platform.hmcts.net"
    }

  # module.public-dns.azurerm_dns_cname_record.this["afdverify.labs-louisehuyton-walkthrough"] will be created
  + resource "azurerm_dns_cname_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "afdverify.labs-louisehuyton-walkthrough"
      + record              = "afdverify.hmcts-sbox.azurefd.net"
      + resource_group_name = "reformmgmtrg"
      + ttl                 = 300
      + zone_name           = "sandbox.platform.hmcts.net"
    }

  # module.public-dns.azurerm_dns_cname_record.this["afdverify.labs-zcwalkthrough-nodejs"] will be created
  + resource "azurerm_dns_cname_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "afdverify.labs-zcwalkthrough-nodejs"
      + record              = "afdverify.hmcts-sbox.azurefd.net"
      + resource_group_name = "reformmgmtrg"
      + ttl                 = 3600
      + zone_name           = "sandbox.platform.hmcts.net"
    }

  # module.public-dns.azurerm_dns_cname_record.this["afdverify.plum"] will be created
  + resource "azurerm_dns_cname_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "afdverify.plum"
      + record              = "afdverify.hmcts-sbox.azurefd.net"
      + resource_group_name = "reformmgmtrg"
      + ttl                 = 3600
      + zone_name           = "sandbox.platform.hmcts.net"
    }

  # module.public-dns.azurerm_dns_cname_record.this["afdverify.reformscan"] will be created
  + resource "azurerm_dns_cname_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "afdverify.reformscan"
      + record              = "afdverify.hmcts-sbox.azurefd.net"
      + resource_group_name = "reformmgmtrg"
      + ttl                 = 60
      + zone_name           = "sandbox.platform.hmcts.net"
    }

  # module.public-dns.azurerm_dns_cname_record.this["afdverify.sds-api-mgmt"] will be created
  + resource "azurerm_dns_cname_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "afdverify.sds-api-mgmt"
      + record              = "afdverify.sdshmcts-sbox.azurefd.net"
      + resource_group_name = "reformmgmtrg"
      + ttl                 = 3600
      + zone_name           = "sandbox.platform.hmcts.net"
    }

  # module.public-dns.azurerm_dns_cname_record.this["afdverify.toffee"] will be created
  + resource "azurerm_dns_cname_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "afdverify.toffee"
      + record              = "afdverify.sdshmcts-sbox.azurefd.net"
      + resource_group_name = "reformmgmtrg"
      + ttl                 = 3600
      + zone_name           = "sandbox.platform.hmcts.net"
    }

  # module.public-dns.azurerm_dns_cname_record.this["afdverify.www.plum"] will be created
  + resource "azurerm_dns_cname_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "afdverify.www.plum"
      + record              = "afdverify.hmcts-sbox.azurefd.net"
      + resource_group_name = "reformmgmtrg"
      + ttl                 = 3600
      + zone_name           = "sandbox.platform.hmcts.net"
    }

  # module.public-dns.azurerm_dns_cname_record.this["cdnverify.cft-api-mgmt"] will be created
  + resource "azurerm_dns_cname_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "cdnverify.cft-api-mgmt"
      + record              = "cdnverify.hmcts-cft-api-mgmt-shutter-sbox.azureedge.net"
      + resource_group_name = "reformmgmtrg"
      + ttl                 = 300
      + zone_name           = "sandbox.platform.hmcts.net"
    }

  # module.public-dns.azurerm_dns_cname_record.this["cdnverify.hmi-apim"] will be created
  + resource "azurerm_dns_cname_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "cdnverify.hmi-apim"
      + record              = "cdnverify.hmcts-hmi-apim-shutter-sbox.azureedge.net"
      + resource_group_name = "reformmgmtrg"
      + ttl                 = 300
      + zone_name           = "sandbox.platform.hmcts.net"
    }

  # module.public-dns.azurerm_dns_cname_record.this["cdnverify.idam-user-dashboard"] will be created
  + resource "azurerm_dns_cname_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "cdnverify.idam-user-dashboard"
      + record              = "cdnverify.hmcts-idam-user-dashboard-shutter-sbox.azureedge.net"
      + resource_group_name = "reformmgmtrg"
      + ttl                 = 300
      + zone_name           = "sandbox.platform.hmcts.net"
    }

  # module.public-dns.azurerm_dns_cname_record.this["cdnverify.idam-web-admin"] will be created
  + resource "azurerm_dns_cname_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "cdnverify.idam-web-admin"
      + record              = "cdnverify.hmcts-idam-web-admin-shutter-sbox.azureedge.net"
      + resource_group_name = "reformmgmtrg"
      + ttl                 = 300
      + zone_name           = "sandbox.platform.hmcts.net"
    }

  # module.public-dns.azurerm_dns_cname_record.this["cdnverify.idam-web-public"] will be created
  + resource "azurerm_dns_cname_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "cdnverify.idam-web-public"
      + record              = "cdnverify.hmcts-idam-web-public-shutter-sbox.azureedge.net"
      + resource_group_name = "reformmgmtrg"
      + ttl                 = 300
      + zone_name           = "sandbox.platform.hmcts.net"
    }

  # module.public-dns.azurerm_dns_cname_record.this["cdnverify.idam-web-public-sprod"] will be created
  + resource "azurerm_dns_cname_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "cdnverify.idam-web-public-sprod"
      + record              = "cdnverify.hmcts-idam-web-public-sprod-shutter-sbox.azureedge.net"
      + resource_group_name = "reformmgmtrg"
      + ttl                 = 300
      + zone_name           = "sandbox.platform.hmcts.net"
    }

  # module.public-dns.azurerm_dns_cname_record.this["cdnverify.labs-louisehuyton-walkthrough"] will be created
  + resource "azurerm_dns_cname_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "cdnverify.labs-louisehuyton-walkthrough"
      + record              = "cdnverify.hmcts-labs-louisehuyton-walkthrough-shutter-sbox.azureedge.net"
      + resource_group_name = "reformmgmtrg"
      + ttl                 = 300
      + zone_name           = "sandbox.platform.hmcts.net"
    }

  # module.public-dns.azurerm_dns_cname_record.this["cdnverify.labs-zcwalkthrough-nodejs"] will be created
  + resource "azurerm_dns_cname_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "cdnverify.labs-zcwalkthrough-nodejs"
      + record              = "cdnverify.hmcts-labs-zcwalkthrough-nodejs-shutter-sbox.azureedge.net"
      + resource_group_name = "reformmgmtrg"
      + ttl                 = 300
      + zone_name           = "sandbox.platform.hmcts.net"
    }

  # module.public-dns.azurerm_dns_cname_record.this["cdnverify.plum"] will be created
  + resource "azurerm_dns_cname_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "cdnverify.plum"
      + record              = "cdnverify.hmcts-plum-shutter-sbox.azureedge.net"
      + resource_group_name = "reformmgmtrg"
      + ttl                 = 300
      + zone_name           = "sandbox.platform.hmcts.net"
    }

  # module.public-dns.azurerm_dns_cname_record.this["cdnverify.reformscan"] will be created
  + resource "azurerm_dns_cname_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "cdnverify.reformscan"
      + record              = "cdnverify.hmcts-reformscan-shutter-sbox.azureedge.net"
      + resource_group_name = "reformmgmtrg"
      + ttl                 = 300
      + zone_name           = "sandbox.platform.hmcts.net"
    }

  # module.public-dns.azurerm_dns_cname_record.this["cdnverify.toffee"] will be created
  + resource "azurerm_dns_cname_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "cdnverify.toffee"
      + record              = "cdnverify.hmcts-toffee-shutter-sbox.azureedge.net"
      + resource_group_name = "reformmgmtrg"
      + ttl                 = 300
      + zone_name           = "sandbox.platform.hmcts.net"
    }

  # module.public-dns.azurerm_dns_cname_record.this["cft-api-mgmt"] will be created
  + resource "azurerm_dns_cname_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "cft-api-mgmt"
      + record              = "hmcts-sbox.azurefd.net"
      + resource_group_name = "reformmgmtrg"
      + ttl                 = 300
      + zone_name           = "sandbox.platform.hmcts.net"
    }

  # module.public-dns.azurerm_dns_cname_record.this["hmi-apim"] will be created
  + resource "azurerm_dns_cname_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "hmi-apim"
      + record              = "hmcts-sbox.azurefd.net"
      + resource_group_name = "reformmgmtrg"
      + ttl                 = 300
      + zone_name           = "sandbox.platform.hmcts.net"
    }

  # module.public-dns.azurerm_dns_cname_record.this["idam-user-dashboard"] will be created
  + resource "azurerm_dns_cname_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "idam-user-dashboard"
      + record              = "hmcts-sbox.azurefd.net"
      + resource_group_name = "reformmgmtrg"
      + ttl                 = 300
      + zone_name           = "sandbox.platform.hmcts.net"
    }

  # module.public-dns.azurerm_dns_cname_record.this["idam-web-admin"] will be created
  + resource "azurerm_dns_cname_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "idam-web-admin"
      + record              = "hmcts-sbox.azurefd.net"
      + resource_group_name = "reformmgmtrg"
      + ttl                 = 300
      + zone_name           = "sandbox.platform.hmcts.net"
    }

  # module.public-dns.azurerm_dns_cname_record.this["idam-web-public"] will be created
  + resource "azurerm_dns_cname_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "idam-web-public"
      + record              = "hmcts-sbox.azurefd.net"
      + resource_group_name = "reformmgmtrg"
      + ttl                 = 300
      + zone_name           = "sandbox.platform.hmcts.net"
    }

  # module.public-dns.azurerm_dns_cname_record.this["idam-web-public-sprod"] will be created
  + resource "azurerm_dns_cname_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "idam-web-public-sprod"
      + record              = "hmcts-sbox.azurefd.net"
      + resource_group_name = "reformmgmtrg"
      + ttl                 = 300
      + zone_name           = "sandbox.platform.hmcts.net"
    }

  # module.public-dns.azurerm_dns_cname_record.this["labs-louisehuyton-walkthrough"] will be created
  + resource "azurerm_dns_cname_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "labs-louisehuyton-walkthrough"
      + record              = "hmcts-sbox.azurefd.net"
      + resource_group_name = "reformmgmtrg"
      + ttl                 = 300
      + zone_name           = "sandbox.platform.hmcts.net"
    }

  # module.public-dns.azurerm_dns_cname_record.this["labs-zcwalkthrough-nodejs"] will be created
  + resource "azurerm_dns_cname_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "labs-zcwalkthrough-nodejs"
      + record              = "hmcts-sbox.azurefd.net"
      + resource_group_name = "reformmgmtrg"
      + ttl                 = 300
      + zone_name           = "sandbox.platform.hmcts.net"
    }

  # module.public-dns.azurerm_dns_cname_record.this["plum"] will be created
  + resource "azurerm_dns_cname_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "plum"
      + record              = "hmcts-sbox.azurefd.net"
      + resource_group_name = "reformmgmtrg"
      + ttl                 = 300
      + zone_name           = "sandbox.platform.hmcts.net"
    }

  # module.public-dns.azurerm_dns_cname_record.this["plum.uksouth"] will be created
  + resource "azurerm_dns_cname_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "plum.uksouth"
      + record              = "firewall-sbox.uksouth.cloudapp.azure.com"
      + resource_group_name = "reformmgmtrg"
      + ttl                 = 3600
      + zone_name           = "sandbox.platform.hmcts.net"
    }

  # module.public-dns.azurerm_dns_cname_record.this["reformscan"] will be created
  + resource "azurerm_dns_cname_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "reformscan"
      + record              = "hmcts-sbox.azurefd.net"
      + resource_group_name = "reformmgmtrg"
      + ttl                 = 60
      + zone_name           = "sandbox.platform.hmcts.net"
    }

  # module.public-dns.azurerm_dns_cname_record.this["sds-api-mgmt"] will be created
  + resource "azurerm_dns_cname_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "sds-api-mgmt"
      + record              = "sdshmcts-sbox.azurefd.net"
      + resource_group_name = "reformmgmtrg"
      + ttl                 = 300
      + zone_name           = "sandbox.platform.hmcts.net"
    }

  # module.public-dns.azurerm_dns_cname_record.this["toffee"] will be created
  + resource "azurerm_dns_cname_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "toffee"
      + record              = "sdshmcts-sbox.azurefd.net"
      + resource_group_name = "reformmgmtrg"
      + ttl                 = 300
      + zone_name           = "sandbox.platform.hmcts.net"
    }

  # module.public-dns.azurerm_dns_cname_record.this["www.plum"] will be created
  + resource "azurerm_dns_cname_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "www.plum"
      + record              = "hmcts-sbox.azurefd.net"
      + resource_group_name = "reformmgmtrg"
      + ttl                 = 300
      + zone_name           = "sandbox.platform.hmcts.net"
    }

  # module.public-dns.azurerm_dns_mx_record.this["@"] will be created
  + resource "azurerm_dns_mx_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "@"
      + resource_group_name = "reformmgmtrg"
      + ttl                 = 300
      + zone_name           = "sandbox.platform.hmcts.net"

      + record {
          + exchange   = "mail.contact.justice.sandbox.platform.hmcts.net"
          + preference = "0"
        }
    }

  # module.public-dns.azurerm_dns_mx_record.this["contact.justice"] will be created
  + resource "azurerm_dns_mx_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "contact.justice"
      + resource_group_name = "reformmgmtrg"
      + ttl                 = 3600
      + zone_name           = "sandbox.platform.hmcts.net"

      + record {
          + exchange   = "ctscmail.sandbox.platform.hmcts.net"
          + preference = "10"
        }
    }

  # module.public-dns.azurerm_dns_txt_record.this["_dmarc.contact.justice"] will be created
  + resource "azurerm_dns_txt_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "_dmarc.contact.justice"
      + resource_group_name = "reformmgmtrg"
      + ttl                 = 3600
      + zone_name           = "sandbox.platform.hmcts.net"

      + record {
          + value = "v=DMARC1; p=none"
        }
    }

  # module.public-dns.azurerm_dns_txt_record.this["contact.justice"] will be created
  + resource "azurerm_dns_txt_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "contact.justice"
      + resource_group_name = "reformmgmtrg"
      + ttl                 = 3600
      + zone_name           = "sandbox.platform.hmcts.net"

      + record {
          + value = "v=spf1 ip4:51.105.21.172  ip4:51.105.21.118 -all"
        }
    }

  # module.public-dns.azurerm_dns_zone.zone will be created
  + resource "azurerm_dns_zone" "zone" {
      + id                        = (known after apply)
      + max_number_of_record_sets = (known after apply)
      + name                      = "sandbox.platform.hmcts.net"
      + name_servers              = (known after apply)
      + number_of_record_sets     = (known after apply)
      + resource_group_name       = "reformMgmtRG"

      + soa_record {
          + email         = (known after apply)
          + expire_time   = (known after apply)
          + fqdn          = (known after apply)
          + host_name     = (known after apply)
          + minimum_ttl   = (known after apply)
          + refresh_time  = (known after apply)
          + retry_time    = (known after apply)
          + serial_number = (known after apply)
          + tags          = (known after apply)
          + ttl           = (known after apply)
        }
    }

  # module.public-dns.azurerm_role_assignment.dnszonecontributer will be created
  + resource "azurerm_role_assignment" "dnszonecontributer" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "6c2d130e-ba66-408a-bdf9-f426a9730923"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "DNS Zone Contributor"
      + scope                            = (known after apply)
      + skip_service_principal_aad_check = (known after apply)
    }

Plan: 52 to add, 0 to change, 0 to destroy.
```

</details>





<!-- github-comment: {"Command":"plan","PRNumber":958,"Program":"tfcmt","SHA1":"","Target":"sandbox-uksouth-sandbox","Vars":{}} -->